src/cfe/КСП/Documents/ЗаказНаВнутреннееПотребление.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаВнутреннееПотребление</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КСП_ДиспетчерРаспределения</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КСП_Коллекция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КоллекцииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КСП_ТипДокументаСлужебногоРезерва</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КСП_ТипДокументаСлужебногоРезерва</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cfe/КСП/Enums/КСП_ТипДокументаСлужебногоРезерва.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>КСП_ТипДокументаСлужебногоРезерва</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РаспределениеГотовойПродукцииКаналы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РезервКонтрольКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Резерв2Разбраковка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cfe/КСП/Documents/ЗаказНаВнутреннееПотребление/Ext/ObjectModule.bsl
&После("ПередЗаписью")
Процедура КСП_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ЭтоНовый() ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерДок = Документы.ЗаказНаВнутреннееПотребление;
	ТипДокумента = ЭтотОбъект.КСП_ТипДокументаСлужебногоРезерва;
	ПростоЗапись = (РежимЗаписи = РежимЗаписиДокумента.Запись);
	
	// Распределение готовой продукции
	ЭтоРаспределениеГотовойПродукции = (
		ТипДокумента = Перечисления.КСП_ТипДокументаСлужебногоРезерва.РаспределениеГотовойПродукции);
	ДиспетчерРаспределенияЗаписывает = МенеджерДок.КСП_ЭтоЗаписьДиспетчеромРаспределенияГотовойПродукции(ЭтотОбъект);
	
	Если ЭтоРаспределениеГотовойПродукции Тогда
		
		// Временно отключено для отладки работы распределения товаров по каналам продаж Ситько.
		
		//Если НЕ ДиспетчерРаспределенияЗаписывает И НЕ ПростоЗапись Тогда
		//	ТекстИсключения = НСтр(
		//		"ru = 'Документ для распределения готовой продукции можно провести только через
		//		|интерфейс обработки [Диспетчер распределения готовой продукции]'");
		//	ВызватьИсключение ТекстИсключения;
		//КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ТипДокумента) Тогда
			ТекстИсключения = НСтр(
				"ru = 'Для распределения готовой продукции требуется подразделение!'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ЭтотОбъект.КСП_Коллекция) Тогда
			ТекстИсключения = НСтр(
				"ru = 'Для распределения готовой продукции требуется коллекция номенклатуры!'");
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		РегистрыСведений.КСП_ИсторияРаспределенияГотовойПродукции.ЗаписатьИзмененияРаспределенияДокументом(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры
